In [4]:
import pandas as pd
import pickle

In [5]:
kbo = pd.read_pickle("./kbo_detail.pkl")

In [6]:
kbo[['team','선수명']]

       team   선수명
0    한화 이글스   강재민
1    한화 이글스   권광민
2    한화 이글스   권동욱
3    한화 이글스    권현
4    한화 이글스   김강민
..      ...   ...
839   KT 위즈   한민우
840   KT 위즈   한차현
841   KT 위즈   홍현빈
842   KT 위즈   황의준
843   KT 위즈   황재균

[844 rows x 2 columns]

In [7]:
kbo['신장' ] = kbo['신장/체중'].apply(lambda x : int(x.split("/")[0].replace("cm", "")))

In [8]:
kbo['체중' ] = kbo['신장/체중'].apply(lambda x : int(x.split("/")[1].replace("kg", "")))

In [9]:
kbo['BMI']  = kbo['체중' ] / (kbo['신장']/100)**2

In [10]:
kbo.sort_values(by='BMI', ascending=False).head()

,선수명,등번호,생년월일,포지션,신장/체중,경력,입단 계약금,연봉,지명순위,입단년도,team,신장,체중,BMI
10,김민우,No.53,1995년 07월 25일,투수(우투우타),186cm/123kg,사파초-마산중-용마고,20000만원,16700만원,15 한화 2차 1라운드 1순위,15한화,한화 이글스,186,123,35.553243
356,김범석,No.55,2004년 05월 21일,포수(우투우타),178cm/110kg,김해삼성초-경남중-경남고,25000만원,3300만원,23 LG 1라운드 7순위,23LG,LG 트윈스,178,110,34.717839
30,박성웅,No.63,1999년 08월 20일,투수(좌투좌타),178cm/109kg,광주서석초-충장중-광주제일고,10000만원,3300만원,18 한화 2차 2라운드 14순위,18한화,한화 이글스,178,109,34.402222
57,이성원,No.98,1999년 11월 02일,내야수(우투우타),185cm/115kg,수원신곡초-매향중-장안고,6000만원,3000만원,18 한화 2차 6라운드 54순위,,한화 이글스,185,115,33.601169
509,김기연,No.45,1997년 09월 07일,포수(우투우타),178cm/106kg,광주수창초-진흥중-진흥고-LG,7000만원,4000만원,16 LG 2차 4라운드 34순위,17LG,두산 베어스,178,106,33.455372

In [11]:
kbo.drop(['신장/체중'], axis=1, inplace=True)

In [12]:
kbo2 = kbo.groupby('team')[['신장', '체중']].mean()

In [13]:
kbo2.loc[ 'KIA 타이거즈' , :  ]

신장    182.773810
체중     88.666667
Name: KIA 타이거즈, dtype: float64

In [14]:
kbo2.loc[ 'KIA 타이거즈' , :  ]

신장    182.773810
체중     88.666667
Name: KIA 타이거즈, dtype: float64

In [15]:
kbo2.loc[ 'KIA 타이거즈':'SSG 랜더스' , '신장'  ]

team
KIA 타이거즈    182.773810
KT 위즈       182.103448
LG 트윈스      182.986486
NC 다이노스     183.146067
SSG 랜더스     181.975309
Name: 신장, dtype: float64

In [16]:
kbo2.iloc[2:4, 0]

team
LG 트윈스     182.986486
NC 다이노스    183.146067
Name: 신장, dtype: float64